app/views/todo_items/_todo_item.html.erb

SELECT "tags".* FROM "tags" INNER JOIN "taggings" ON "tags"."id" = "taggings"."tag_id" WHERE "taggings"."todo_item_id" = ?  [["todo_item_id", 1]]
---
      Tags:
      <% todo_item.tags.each do |tag| %>