app/controllers/tags_controller.rb

SELECT  "tags".* FROM "tags" WHERE "tags"."name" = ? LIMIT ?  [["name", "tag1"], ["LIMIT", 1]]
---
  def search
    tag_search = params[:search].downcase
    @tag = Tag.find_by(name: tag_search) if tag_search