app/controllers/todo_items_controller.rb

  def update
    @todo_item = make_todo_item
    respond_to do |format|
      if @todo_item.update(todo_item_params)
---
UPDATE "todo_items" SET "content" = ?, "updated_at" = ? WHERE "todo_items"."id" = ?  [["content", "lol"], ["updated_at", "2020-01-18 10:58:17.192037"], ["id", 6]]

  def create
    @todo_item = @todo_list.todo_items.create(todo_item_params)
---
INSERT INTO "todo_items" ("content", "todo_list_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "no"], ["todo_list_id", 1], ["created_at", "2020-01-18 09:59:34.807177"], ["updated_at", "2020-01-18 09:59:34.807177"]]

  def destroy
    flash = {success: "You have deleted this task", error: "This task could not be deleted" }
    @todo_item = @todo_list.todo_items.find(params[:id])
    if @todo_item.destroy
---
SELECT  "todo_items".* FROM "todo_items" WHERE "todo_items"."todo_list_id" = ? AND "todo_items"."id" = ? LIMIT ?  [["todo_list_id", 3], ["id", 3], ["LIMIT", 1]]
DELETE FROM "todo_items" WHERE "todo_items"."id" = ?  [["id", 3]]

  def complete
    if !@todo_item.completed?
      @todo_item.update_attribute(:completed_at, Time.now)
    else
      @todo_item.update_attribute(:completed_at, nil)
---
UPDATE "todo_items" SET "completed_at" = ?, "updated_at" = ? WHERE "todo_items"."id" = ?  [["completed_at", "2020-01-20 10:34:33.609640"], ["updated_at", "2020-01-20 10:34:33.614939"], ["id", 7]]
UPDATE "todo_items" SET "completed_at" = ?, "updated_at" = ? WHERE "todo_items"."id" = ?  [["completed_at", nil], ["updated_at", "2020-01-20 10:36:26.416113"], ["id", 3]]

    def make_todo_list
      @todo_list = TodoList.find(params[:todo_list_id])
---
SELECT  "todo_lists".* FROM "todo_lists" WHERE "todo_lists"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def make_todo_item
      @todo_item = @todo_list.todo_items.find(params[:id])
---
SELECT  "todo_items".* FROM "todo_items" WHERE "todo_items"."todo_list_id" = ? AND "todo_items"."id" = ? LIMIT ?  [["todo_list_id", 1], ["id", 8], ["LIMIT", 1]]