app/controllers/todo_lists_controller.rb

  def index
    @todo_lists = TodoList.all
---
SELECT "todo_lists".* FROM "todo_lists"

  def create
    @todo_list = TodoList.new(todo_list_params)

    respond_to do |format|
      if @todo_list.save
---
INSERT INTO "todo_lists" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Sample Title"], ["description", "Sample Description 1"], ["created_at", "2020-01-20 10:43:05.074877"], ["updated_at", "2020-01-20 10:43:05.074877"]]

  def destroy
    flash = {success: "You have deleted the todo list", error: "The todo list could not be deleted" }
    if @todo_list.destroy
---
DELETE FROM "todo_lists" WHERE "todo_lists"."id" = ?  [["id", 1]]

    def set_todo_list
      @todo_list = TodoList.find(params[:id])
---
SELECT  "todo_lists".* FROM "todo_lists" WHERE "todo_lists"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]