app/controllers/todo_items_controller.rb

SELECT  "todo_lists".* FROM "todo_lists" WHERE "todo_lists"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def make_todo_list
      @todo_list = TodoList.find(params[:todo_list_id])