app/models/todo_item.rb

SELECT "tags".* FROM "tags" INNER JOIN "taggings" ON "tags"."id" = "taggings"."tag_id" WHERE "taggings"."todo_item_id" = ?  [["todo_item_id", 3]]
---
  def list_of_tags
    arr_of_tags = []
    self.tags.each do |tag|

INSERT INTO "tags" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "ikr"], ["created_at", "2020-01-18 09:26:04.439904"], ["updated_at", "2020-01-18 09:26:04.439904"]]
SELECT  "tags".* FROM "tags" WHERE "tags"."name" = ? LIMIT ?  [["name", "ikr"], ["LIMIT", 1]]
---
  def list_of_tags=(tags_string)
    tag_names = []
    tags_string.split(',').each do |tag_string|
      tag = tag_string.strip.downcase
      tag_names << tag if !tag_names.include?(tag)
    end
    tag_names.collect {|name| self.tags << Tag.find_or_create_by(name: name)}